## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 39 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;cft-api-mgmt&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;adoption&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cft-api-mgmt&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cmc&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cmc-legal&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-amend&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-da&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-dn&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-pfe&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-rfe&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;et-sya&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fact&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fact-admin&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fees-register&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;gateway-ccd&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;hmi-apim&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;ia-aip&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-user-dashboard&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-web-admin&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-web-public&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;lau&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;manage-payments&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;nfdiv-civil-partnership&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;paybubble&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;payment-outcome&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;pcq&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;plum&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;probate&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;reformscan&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;return-case-doc-ccd&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-cor&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-tribunals&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-tya&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-approve-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-manage-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-register-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-webapp&#34;]
* Replace
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;et-sya&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;et-sya&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["et-sya"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-et-sya-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/shutter-app-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-et/endpoints/hmcts-et-sya-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-et-sya-shutter-prod" -> "hmcts-claim-employment-tribunals-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_template_deployment.custom_domain["cft-api-mgmt"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "cft-api-mgmt.platform.hmcts.net"
          + "name"     = "hmcts-shutter-cft-api-mgmt/hmcts-cft-api-mgmt-shutter-prod/cft-api-mgmt-platform-hmcts-net"
        }
      + resource_group_name = "shutter-app-prod-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.azurerm_template_deployment.custom_domain["et-sya"] must be replaced
-/+ resource "azurerm_template_deployment" "custom_domain" {
      ~ id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/shutter-app-prod-rg/providers/Microsoft.Resources/deployments/et-sya" -> (known after apply)
      ~ name                = "et-sya" -> "claim-employment-tribunals" # forces replacement
      ~ outputs             = {} -> (known after apply)
      ~ parameters          = {
          ~ "hostName" = "et-sya.claim-employment-tribunals.service.gov.uk" -> "claim-employment-tribunals.service.gov.uk"
          ~ "name"     = "hmcts-shutter-et/hmcts-et-sya-shutter-prod/et-sya-claim-employment-tribunals-service-gov-uk" -> "hmcts-shutter-et/hmcts-claim-employment-tribunals-shutter-prod/claim-employment-tribunals-service-gov-uk"
        }
        # (3 unchanged attributes hidden)
    }

  # module.shutter.null_resource.enable_custom_https_cmd["adoption"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "929239c881ca49928201e6759dd33e30"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cft-api-mgmt"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "0d115f28258e4ce489964c8d7389541d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cmc"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "41a45a073884455ea9be55d59a137974"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cmc-legal"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "70706f8d42634d938d5f5d4d8ddac9b7"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-amend"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "1b72d8d2d1a24e09a3f629be68bcadef"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-da"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "6756c7f47d274c1bad33e8aab733eb68"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-dn"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "963d29c8f7e548bba6fd693609b2170d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-pfe"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "29cb175c603f45ba9a9545c10f39fc9e"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-rfe"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "be3ad4ff06e24590a951ab80ed7eaf04"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["et-sya"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9bc8c348f31b46b1b3675b35b204ad71"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fact"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "4bc4a1f48477453cb9844d94be880ec9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fact-admin"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "4bc4a1f48477453cb9844d94be880ec9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fees-register"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "99dd8dbf42b24711b385032db07a4377"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["gateway-ccd"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "dec264ed38854ba39b8c15ed4f231911"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["hmi-apim"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "0d115f28258e4ce489964c8d7389541d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["ia-aip"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "8b7c7526cef443578ab39d59f257966d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-user-dashboard"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "08ea779253324161baa40748178d606b"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-web-admin"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "16d5909323f64e579475455d00e6e623"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-web-public"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "8d343a7aa1424c0782629ccf5de165bf"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["lau"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "3a6e89d76d574798ae33d669f324498b"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["manage-payments"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "b57b027243264d0eaa98dfac086592fc"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["nfdiv-civil-partnership"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "582e6251dae846848947e98be6f4c50a"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["paybubble"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "732552e97c9d4a058585526240314ab9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["payment-outcome"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "dc63162b7f1b49879017c795974262e9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["pcq"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "3cfd1c63aa884555a66fe991859f4d1d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["plum"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "0d115f28258e4ce489964c8d7389541d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["probate"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "36b29ca59f554541b3a5fbee65a3d5c8"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["reformscan"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "0d115f28258e4ce489964c8d7389541d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["return-case-doc-ccd"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "dec264ed38854ba39b8c15ed4f231911"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-cor"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "9713e7196d654c7f99207f273cc1c0ec"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-tribunals"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "bb0901dad0624937bcc6ab1c84b67a64"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-tya"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "89af2e8ff5ca43318c8c7b96391e354f"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-approve-org"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "65e5f571e94142b0b8b18d3edba91617"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-manage-org"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "05d80ff9f9d640599356ccf2b5930660"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-register-org"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "ef07a14998014521a58c7928bd5bec85"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-webapp"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "475e8e4da390405c9f668861f7b9ee3c"
        }
    }

Plan: 39 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1284,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->